In [2]:
import pandas as pd
import json

with open("stations.json") as f:
    data = json.load(f)

list_data = []

for i in list(data["features"].keys()):
    list_data.append(data["features"][i]["properties"])
    
df = pd.DataFrame(list_data)
df

,COMMUNE,NUM_POSTE,ALTI,NOM_USUEL,LAT_DG,NUM_DEP,LON_DG,ficheClimComplete,ficheClimReduite
0,ARBENT,01014002,534,ARBENT,46.278167,1,5.669000,0,1
1,BALAN,01027003,196,BALAN_AERO,45.833000,1,5.106667,0,0
2,BANEINS,01028001,243,BANEINS,46.122000,1,4.904500,0,1
3,VALSERHONE,01033002,350,BELLEGARDE,46.086500,1,5.814167,1,1
4,BELLEY,01034004,330,BELLEY,45.769333,1,5.688000,0,1
...,...,...,...,...,...,...,...,...,...
2389,POYA,98827002,82,NEPOUI,-21.318167,988,165.002167,1,1
2390,TOUHO,98830002,2,TOUHO AEROD.,-20.789333,988,165.254500,0,1
2391,YATE,98832002,25,YATE MRIE,-22.156500,988,166.939000,0,1
2392,YATE,98832006,171,RIVIERE BLANCHE,-22.132667,988,166.726333,0,1
2393,YATE,98832101,298,GORO_ANCIENNE_PEPINIERE,-22.269167,988,166.967500,0,1

In [3]:
df.to_csv('../final_data/stations_metadata.csv', index=False)

In [18]:
station_types = pd.read_csv("../final_data/postes_meteo.csv")
df['NUM_POSTE'] = df['NUM_POSTE'].astype(int)
merged_df = station_types.merge(df, left_on='num_poste', right_on='NUM_POSTE')
merged_df = merged_df.drop(["NUM_POSTE", "LAT_DG", "LON_DG", "ficheClimReduite", "ficheClimComplete"], axis=1)
merged_df = merged_df.rename(columns={'latitude(°)': 'latitude', 'longitude(°)': 'longitude', "COMMUNE": "commune", "ALTI": "altitude", "NOM_USUEL": "nom_usuel", "NUM_DEP": "num_dep"})
merged_df.head()

,num_poste,latitude,longitude,type,commune,altitude,nom_usuel,num_dep
0,6088001,43.649,7.209,IN,NICE,2,NICE,6
1,6088001,43.649,7.209,RR,NICE,2,NICE,6
2,6088001,43.649,7.209,TN,NICE,2,NICE,6
3,6088001,43.649,7.209,TX,NICE,2,NICE,6
4,13054001,43.438,5.216,IN,MARIGNANE,9,MARIGNANE,13

In [20]:
merged_df.to_csv('../final_data/full_stations_metadata.csv', index=False)